In [2]:
import pandas as pd
import seaborn as sns
import matplotlib as plt

In [22]:
column_types = {
    'award_titile':'object',
    'years':'object',
    'finalist':'object',
    'winner':'category',
    'groups':'object'
}
df = pd.read_csv('Prime.csv',dtype=column_types)

In [8]:
df1 = pd.read_csv('http://www.ishelp.info/data/insurance.csv')
df1

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [23]:
df.describe()

,award_title,years,finalist,winner,groups
count,22572,22656,22502,5100,21540
unique,1191,72,6503,1,14971
top,Outstanding Comedy Series,2020 Awards,Saturday Night Live,Winner,Saturday Night Live
freq,284,651,208,5100,80

In [17]:
df.columns

Index(['award_title', 'years', 'finalist', 'winner', 'groups'], dtype='object')

In [18]:
print(f'years:{df.years.count()}')
print(f'award_title:{df.award_title.count()}')
print(f'finalist:{df.finalist.count()}')
print(f'winner:{df.winner.count()}')
print(f'groups:{df.groups.count()}')

years:22656
award_title:22572
finalist:22502
winner:5100
groups:21540

In [19]:
print(f'years:{df.years.nunique()}')
print(f'award_title:{df.award_title.nunique()}')
print(f'finalist:{df.finalist.nunique()}')
print(f'winner:{df.winner.nunique()}')
print(f'groups:{df.groups.nunique()}')

years:72
award_title:1191
finalist:6503
winner:1
groups:14971

In [14]:
df.shape

(22656, 5)

In [12]:
df1.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010